yohanes-erwin/stm32f103-sw4stm32/stm32f103-hal-spi-shift-register-ic-dma/src/main.c
/**
  ******************************************************************************
  * @file    ../stm32f103-hal-spi-shift-register-ic-dma/src/main.c
  * @author  Erwin Ouyang
  * @version 1.0
  * @date    6 Feb 2017
  * @brief   This example shows how to use SPI HAL API to transmit and receive
  *          a data byte with a communication process based on DMA transfer.
  *          The communication is done with the 74595 shift regiser IC.
  ******************************************************************************
  * Copyright (c) 2017 Erwin Ouyang
  *
  * Permission is hereby granted, free of charge, to any person obtaining a copy
  * of this software and associated documentation files (the "Software"), to
  * deal in the Software without restriction, including without limitation the
  * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
  * sell copies of the Software, and to permit persons to whom the Software is
  * furnished to do so, subject to the following conditions:
  *
  * The above copyright notice and this permission notice shall be included in
  * all copies or substantial portions of the Software.
  *
  * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
  * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
  * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
  * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
  * IN THE SOFTWARE.
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
SPI_HandleTypeDef spiHandle;

uint8_t txData[8] = { 0x01, 0x02, 0x04, 0x08, 0x10, 0x20, 0x40, 0x80 };
uint8_t rxData;

/* Private function prototypes -----------------------------------------------*/
void RCC_SystemClock_Config(void);
void GPIO_Output_Config(void);
void GPIO_Input_Config(void);
void SPI_Config(void);
void SR_Latch(void);
void Error_Handler(void);

/* Private functions ---------------------------------------------------------*/
/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{
	/*## HAL initialization ##################################################*/
	HAL_Init();

	/*## System clocks initialization ########################################*/
	/* Set the SYSCLK at maximum frequency (72 MHz) */
	RCC_SystemClock_Config();

	/*## GPIO initialization #################################################*/
	GPIO_Output_Config();
	GPIO_Input_Config();

	/*## SPI initialization ##################################################*/
	SPI_Config();

	/*## SPI communication ###################################################*/
	/* Wait for user button press before starting the communication */
	while (HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_15) == GPIO_PIN_SET);
	/* Wait for user button release before starting the communication */
	while (HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_15) == GPIO_PIN_RESET);

	HAL_SPI_TransmitReceive_DMA(&spiHandle, &txData[0], &rxData, 1);

	/* Wait for user button press before starting the communication */
	while (HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_15) == GPIO_PIN_SET);
	/* Wait for user button release before starting the communication */
	while (HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_15) == GPIO_PIN_RESET);

	HAL_SPI_TransmitReceive_DMA(&spiHandle, &txData[1], &rxData, 1);

	HAL_Delay(10);

	if (rxData == 0x01)
	{
		/* Turn green LED on */
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, GPIO_PIN_SET);
	}

	/*## Main loop ###########################################################*/
	while (1);
}

/**
  * @brief  System clock configuration:
  *             System clock source = PLL (HSE)
  *             SYSCLK(Hz)          = 72000000
  *             HCLK(Hz)            = 72000000
  *             AHB prescaler       = 1
  *             APB1 prescaler      = 2
  *             APB2 prescaler      = 1
  *             HSE frequency(Hz)   = 8000000
  *             HSE PREDIV1         = 1
  *             PLLMUL              = 9
  *             Flash latency(WS)   = 2
  * @param  None
  * @retval None
  */
void RCC_SystemClock_Config(void)
{
	RCC_ClkInitTypeDef rccClkInit;
	RCC_OscInitTypeDef rccOscInit;

	/*## STEP 1: Configure HSE and PLL #######################################*/
	rccOscInit.OscillatorType = RCC_OSCILLATORTYPE_HSE;
	rccOscInit.HSEState       = RCC_HSE_ON;
	rccOscInit.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
	rccOscInit.PLL.PLLState   = RCC_PLL_ON;
	rccOscInit.PLL.PLLSource  = RCC_PLLSOURCE_HSE;
	rccOscInit.PLL.PLLMUL     = RCC_PLL_MUL9;
	if (HAL_RCC_OscConfig(&rccOscInit) != HAL_OK)
	{
		Error_Handler();
	}

	/*## STEP 2: Configure SYSCLK, HCLK, PCLK1, and PCLK2 ####################*/
	rccClkInit.ClockType      = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK |
			RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
	rccClkInit.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
	rccClkInit.AHBCLKDivider  = RCC_SYSCLK_DIV1;
	rccClkInit.APB2CLKDivider = RCC_HCLK_DIV1;
	rccClkInit.APB1CLKDivider = RCC_HCLK_DIV2;
	if (HAL_RCC_ClockConfig(&rccClkInit, FLASH_LATENCY_2) != HAL_OK)
	{
		Error_Handler();
	}
}

/**
  * @brief  GPIO configuration:
  *             GPIO  = GPIOB
  *             Pin   = PB6, PB7, PB8, PB9
  *             Mode  = Output push-pull
  *             Speed = Low
  * @param  None
  * @retval None
  */
void GPIO_Output_Config(void)
{
	GPIO_InitTypeDef gpioInit;

	/*## STEP 1: Configure RCC peripheral ####################################*/
	__HAL_RCC_GPIOB_CLK_ENABLE();

	/*## STEP 2: Configure GPIO ##############################################*/
	gpioInit.Pin   = GPIO_PIN_6 | GPIO_PIN_7 | GPIO_PIN_8 | GPIO_PIN_9;
	gpioInit.Mode  = GPIO_MODE_OUTPUT_PP;
	gpioInit.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(GPIOB, &gpioInit);
}

/**
  * @brief  GPIO configuration:
  *             GPIO = GPIOC
  *             Pin  = PC15
  *             Mode = Input
  *             Pull = Pull-up
  * @param  None
  * @retval None
  */
void GPIO_Input_Config(void)
{
	GPIO_InitTypeDef gpioInit;

	/*## STEP 1: Configure RCC peripheral ####################################*/
	__HAL_RCC_GPIOC_CLK_ENABLE();

	/*## STEP 2: Configure GPIO ##############################################*/
	gpioInit.Pin  = GPIO_PIN_15;
	gpioInit.Mode = GPIO_MODE_INPUT;
	gpioInit.Pull = GPIO_PULLUP;
	HAL_GPIO_Init(GPIOC, &gpioInit);
}

/**
  * @brief  SPI master configuration:
  *             SPI                 = SPI1
  *             Mode                = Master
  *             Direction           = 2 lines
  *             Data size           = 8-bit
  *             Clock polarity      = High
  *             Clock phase         = First edge
  *             Slave select        = Software select
  *             Baud rate prescaler = 256
  *             First bit           = MSB
  *             TI mode             = Disable
  *             CRC calculation     = Disable
  * @param  None
  * @retval None
  */
void SPI_Config(void)
{
	/*## STEP 1: Configure SPI ###############################################*/
	spiHandle.Instance               = SPI1;
	spiHandle.Init.Mode              = SPI_MODE_MASTER;
	spiHandle.Init.Direction         = SPI_DIRECTION_2LINES;
	spiHandle.Init.DataSize          = SPI_DATASIZE_8BIT;
	spiHandle.Init.CLKPolarity       = SPI_POLARITY_HIGH;
	spiHandle.Init.CLKPhase          = SPI_PHASE_1EDGE;
	spiHandle.Init.NSS               = SPI_NSS_HARD_OUTPUT;
	spiHandle.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_256;
	spiHandle.Init.FirstBit          = SPI_FIRSTBIT_MSB;
	spiHandle.Init.TIMode            = SPI_TIMODE_DISABLE;
	spiHandle.Init.CRCCalculation    = SPI_CRCCALCULATION_DISABLE;
	if(HAL_SPI_Init(&spiHandle) != HAL_OK)
	{
		Error_Handler();
	}
}

/**
  * @brief  SPI MSP configuration callback.
  * @param  hspi: SPI handle pointer
  * @retval None
  */
void HAL_SPI_MspInit(SPI_HandleTypeDef *hspi)
{
	GPIO_InitTypeDef gpioInit;
	static DMA_HandleTypeDef dmaHandleTx;
	static DMA_HandleTypeDef dmaHandleRx;

	/*## STEP 1: Configure RCC ###############################################*/
	__HAL_RCC_SPI1_CLK_ENABLE();
	__HAL_RCC_GPIOA_CLK_ENABLE();
	__HAL_RCC_DMA1_CLK_ENABLE();

	/*## STEP 2: Configure GPIO ##############################################*/
	/* Configure PA5, PA6, and PA7 for SPI1_SCK, SPI1_MISO, and SPI1_MOSI */
	gpioInit.Pin   = GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7;
	gpioInit.Mode  = GPIO_MODE_AF_PP;
	gpioInit.Pull  = GPIO_PULLUP;
	gpioInit.Speed = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(GPIOA, &gpioInit);
	/* Configure PA8 for shift register latch */
	gpioInit.Pin   = GPIO_PIN_8;
	gpioInit.Mode  = GPIO_MODE_OUTPUT_PP;
	gpioInit.Speed = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(GPIOA, &gpioInit);

	/*## STEP 3: Configure DMA ###############################################*/
	/* DMA handler for transmission process */
	dmaHandleTx.Instance                 = DMA1_Channel3;
	dmaHandleTx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
	dmaHandleTx.Init.PeriphInc           = DMA_PINC_DISABLE;
	dmaHandleTx.Init.MemInc              = DMA_MINC_ENABLE;
	dmaHandleTx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
	dmaHandleTx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
	dmaHandleTx.Init.Mode                = DMA_NORMAL;
	dmaHandleTx.Init.Priority            = DMA_PRIORITY_LOW;
	HAL_DMA_Init(&dmaHandleTx);
	__HAL_LINKDMA(hspi, hdmatx, dmaHandleTx);
	/* DMA handler for reception process */
	dmaHandleRx.Instance                 = DMA1_Channel2;
	dmaHandleRx.Init.Direction           = DMA_PERIPH_TO_MEMORY;
	dmaHandleRx.Init.PeriphInc           = DMA_PINC_DISABLE;
	dmaHandleRx.Init.MemInc              = DMA_MINC_ENABLE;
	dmaHandleRx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
	dmaHandleRx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
	dmaHandleRx.Init.Mode                = DMA_NORMAL;
	dmaHandleRx.Init.Priority            = DMA_PRIORITY_HIGH;
	HAL_DMA_Init(&dmaHandleRx);
	__HAL_LINKDMA(hspi, hdmarx, dmaHandleRx);

	/*## STEP 4: Configure NVIC ##############################################*/
	/* NVIC for DMA1 channel 3 (SPI1_TX) */
	HAL_NVIC_SetPriority(DMA1_Channel3_IRQn, 1, 0);
	HAL_NVIC_EnableIRQ(DMA1_Channel3_IRQn);
	/* NVIC for DMA1 channel 2 (SPI1_RX) */
	HAL_NVIC_SetPriority(DMA1_Channel2_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(DMA1_Channel2_IRQn);
}

/**
  * @brief  TxRx Transfer completed callback
  * @param  hspi: SPI handle.
  * @retval None
  */
void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *hspi)
{
	SR_Latch();
}

/**
  * @brief  SPI error callback
  * @param  hspi: SPI handle
  * @retval None
  */
 void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi)
{
	/* Turn red LED on */
	 HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_SET);
}

/**
  * @brief  Latch the shift register (store shifted data to output buffer).
  * @param  None
  * @retval None
  */
void SR_Latch(void)
{
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_SET);
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
	/* Turn red LED on */
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_SET);
	while (1);
}

/******************************** END OF FILE *********************************/
/******************************************************************************/
